{"weightsManifest": [{"paths": ["group1-shard1of24.bin", "group1-shard2of24.bin", "group1-shard3of24.bin", "group1-shard4of24.bin", "group1-shard5of24.bin", "group1-shard6of24.bin", "group1-shard7of24.bin", "group1-shard8of24.bin", "group1-shard9of24.bin", "group1-shard10of24.bin", "group1-shard11of24.bin", "group1-shard12of24.bin", "group1-shard13of24.bin", "group1-shard14of24.bin", "group1-shard15of24.bin", "group1-shard16of24.bin", "group1-shard17of24.bin", "group1-shard18of24.bin", "group1-shard19of24.bin", "group1-shard20of24.bin", "group1-shard21of24.bin", "group1-shard22of24.bin", "group1-shard23of24.bin", "group1-shard24of24.bin"], "weights": [{"dtype": "float32", "shape": [128], "name": "batch_normalization_35/gamma"}, {"dtype": "float32", "shape": [128], "name": "batch_normalization_35/beta"}, {"dtype": "float32", "shape": [128], "name": "batch_normalization_35/moving_mean"}, {"dtype": "float32", "shape": [128], "name": "batch_normalization_35/moving_variance"}, {"dtype": "float32", "shape": [256], "name": "batch_normalization_36/gamma"}, {"dtype": "float32", "shape": [256], "name": "batch_normalization_36/beta"}, {"dtype": "float32", "shape": [256], "name": "batch_normalization_36/moving_mean"}, {"dtype": "float32", "shape": [256], "name": "batch_normalization_36/moving_variance"}, {"dtype": "float32", "shape": [728], "name": "batch_normalization_37/gamma"}, {"dtype": "float32", "shape": [728], "name": "batch_normalization_37/beta"}, {"dtype": "float32", "shape": [728], "name": "batch_normalization_37/moving_mean"}, {"dtype": "float32", "shape": [728], "name": "batch_normalization_37/moving_variance"}, {"dtype": "float32", "shape": [1024], "name": "batch_normalization_38/gamma"}, {"dtype": "float32", "shape": [1024], "name": "batch_normalization_38/beta"}, {"dtype": "float32", "shape": [1024], "name": "batch_normalization_38/moving_mean"}, {"dtype": "float32", "shape": [1024], "name": "batch_normalization_38/moving_variance"}, {"dtype": "float32", "shape": [3, 3, 728, 1], "name": "block10_sepconv1/depthwise_kernel"}, {"dtype": "float32", "shape": [1, 1, 728, 728], "name": "block10_sepconv1/pointwise_kernel"}, {"dtype": "float32", "shape": [728], "name": "block10_sepconv1_bn/gamma"}, {"dtype": "float32", "shape": [728], "name": "block10_sepconv1_bn/beta"}, {"dtype": "float32", "shape": [728], "name": "block10_sepconv1_bn/moving_mean"}, {"dtype": "float32", "shape": [728], "name": "block10_sepconv1_bn/moving_variance"}, {"dtype": "float32", "shape": [3, 3, 728, 1], "name": "block10_sepconv2/depthwise_kernel"}, {"dtype": "float32", "shape": [1, 1, 728, 728], "name": "block10_sepconv2/pointwise_kernel"}, {"dtype": "float32", "shape": [728], "name": "block10_sepconv2_bn/gamma"}, {"dtype": "float32", "shape": [728], "name": "block10_sepconv2_bn/beta"}, {"dtype": "float32", "shape": [728], "name": "block10_sepconv2_bn/moving_mean"}, {"dtype": "float32", "shape": [728], "name": "block10_sepconv2_bn/moving_variance"}, {"dtype": "float32", "shape": [3, 3, 728, 1], "name": "block10_sepconv3/depthwise_kernel"}, {"dtype": "float32", "shape": [1, 1, 728, 728], "name": "block10_sepconv3/pointwise_kernel"}, {"dtype": "float32", "shape": [728], "name": "block10_sepconv3_bn/gamma"}, {"dtype": "float32", "shape": [728], "name": "block10_sepconv3_bn/beta"}, {"dtype": "float32", "shape": [728], "name": "block10_sepconv3_bn/moving_mean"}, {"dtype": "float32", "shape": [728], "name": "block10_sepconv3_bn/moving_variance"}, {"dtype": "float32", "shape": [3, 3, 728, 1], "name": "block11_sepconv1/depthwise_kernel"}, {"dtype": "float32", "shape": [1, 1, 728, 728], "name": "block11_sepconv1/pointwise_kernel"}, {"dtype": "float32", "shape": [728], "name": "block11_sepconv1_bn/gamma"}, {"dtype": "float32", "shape": [728], "name": "block11_sepconv1_bn/beta"}, {"dtype": "float32", "shape": [728], "name": "block11_sepconv1_bn/moving_mean"}, {"dtype": "float32", "shape": [728], "name": "block11_sepconv1_bn/moving_variance"}, {"dtype": "float32", "shape": [3, 3, 728, 1], "name": "block11_sepconv2/depthwise_kernel"}, {"dtype": "float32", "shape": [1, 1, 728, 728], "name": "block11_sepconv2/pointwise_kernel"}, {"dtype": "float32", "shape": [728], "name": "block11_sepconv2_bn/gamma"}, {"dtype": "float32", "shape": [728], "name": "block11_sepconv2_bn/beta"}, {"dtype": "float32", "shape": [728], "name": "block11_sepconv2_bn/moving_mean"}, {"dtype": "float32", "shape": [728], "name": "block11_sepconv2_bn/moving_variance"}, {"dtype": "float32", "shape": [3, 3, 728, 1], "name": "block11_sepconv3/depthwise_kernel"}, {"dtype": "float32", "shape": [1, 1, 728, 728], "name": "block11_sepconv3/pointwise_kernel"}, {"dtype": "float32", "shape": [728], "name": "block11_sepconv3_bn/gamma"}, {"dtype": "float32", "shape": [728], "name": "block11_sepconv3_bn/beta"}, {"dtype": "float32", "shape": [728], "name": "block11_sepconv3_bn/moving_mean"}, {"dtype": "float32", "shape": [728], "name": "block11_sepconv3_bn/moving_variance"}, {"dtype": "float32", "shape": [3, 3, 728, 1], "name": "block12_sepconv1/depthwise_kernel"}, {"dtype": "float32", "shape": [1, 1, 728, 728], "name": "block12_sepconv1/pointwise_kernel"}, {"dtype": "float32", "shape": [728], "name": "block12_sepconv1_bn/gamma"}, {"dtype": "float32", "shape": [728], "name": "block12_sepconv1_bn/beta"}, {"dtype": "float32", "shape": [728], "name": "block12_sepconv1_bn/moving_mean"}, {"dtype": "float32", "shape": [728], "name": "block12_sepconv1_bn/moving_variance"}, {"dtype": "float32", "shape": [3, 3, 728, 1], "name": "block12_sepconv2/depthwise_kernel"}, {"dtype": "float32", "shape": [1, 1, 728, 728], "name": "block12_sepconv2/pointwise_kernel"}, {"dtype": "float32", "shape": [728], "name": "block12_sepconv2_bn/gamma"}, {"dtype": "float32", "shape": [728], "name": "block12_sepconv2_bn/beta"}, {"dtype": "float32", "shape": [728], "name": "block12_sepconv2_bn/moving_mean"}, {"dtype": "float32", "shape": [728], "name": "block12_sepconv2_bn/moving_variance"}, {"dtype": "float32", "shape": [3, 3, 728, 1], "name": "block12_sepconv3/depthwise_kernel"}, {"dtype": "float32", "shape": [1, 1, 728, 728], "name": "block12_sepconv3/pointwise_kernel"}, {"dtype": "float32", "shape": [728], "name": "block12_sepconv3_bn/gamma"}, {"dtype": "float32", "shape": [728], "name": "block12_sepconv3_bn/beta"}, {"dtype": "float32", "shape": [728], "name": "block12_sepconv3_bn/moving_mean"}, {"dtype": "float32", "shape": [728], "name": "block12_sepconv3_bn/moving_variance"}, {"dtype": "float32", "shape": [3, 3, 728, 1], "name": "block13_sepconv1/depthwise_kernel"}, {"dtype": "float32", "shape": [1, 1, 728, 728], "name": "block13_sepconv1/pointwise_kernel"}, {"dtype": "float32", "shape": [728], "name": "block13_sepconv1_bn/gamma"}, {"dtype": "float32", "shape": [728], "name": "block13_sepconv1_bn/beta"}, {"dtype": "float32", "shape": [728], "name": "block13_sepconv1_bn/moving_mean"}, {"dtype": "float32", "shape": [728], "name": "block13_sepconv1_bn/moving_variance"}, {"dtype": "float32", "shape": [3, 3, 728, 1], "name": "block13_sepconv2/depthwise_kernel"}, {"dtype": "float32", "shape": [1, 1, 728, 1024], "name": "block13_sepconv2/pointwise_kernel"}, {"dtype": "float32", "shape": [1024], "name": "block13_sepconv2_bn/gamma"}, {"dtype": "float32", "shape": [1024], "name": "block13_sepconv2_bn/beta"}, {"dtype": "float32", "shape": [1024], "name": "block13_sepconv2_bn/moving_mean"}, {"dtype": "float32", "shape": [1024], "name": "block13_sepconv2_bn/moving_variance"}, {"dtype": "float32", "shape": [3, 3, 1024, 1], "name": "block14_sepconv1/depthwise_kernel"}, {"dtype": "float32", "shape": [1, 1, 1024, 1536], "name": "block14_sepconv1/pointwise_kernel"}, {"dtype": "float32", "shape": [1536], "name": "block14_sepconv1_bn/gamma"}, {"dtype": "float32", "shape": [1536], "name": "block14_sepconv1_bn/beta"}, {"dtype": "float32", "shape": [1536], "name": "block14_sepconv1_bn/moving_mean"}, {"dtype": "float32", "shape": [1536], "name": "block14_sepconv1_bn/moving_variance"}, {"dtype": "float32", "shape": [3, 3, 1536, 1], "name": "block14_sepconv2/depthwise_kernel"}, {"dtype": "float32", "shape": [1, 1, 1536, 2048], "name": "block14_sepconv2/pointwise_kernel"}, {"dtype": "float32", "shape": [2048], "name": "block14_sepconv2_bn/gamma"}, {"dtype": "float32", "shape": [2048], "name": "block14_sepconv2_bn/beta"}, {"dtype": "float32", "shape": [2048], "name": "block14_sepconv2_bn/moving_mean"}, {"dtype": "float32", "shape": [2048], "name": "block14_sepconv2_bn/moving_variance"}, {"dtype": "float32", "shape": [3, 3, 3, 32], "name": "block1_conv1/kernel"}, {"dtype": "float32", "shape": [32], "name": "block1_conv1_bn/gamma"}, {"dtype": "float32", "shape": [32], "name": "block1_conv1_bn/beta"}, {"dtype": "float32", "shape": [32], "name": "block1_conv1_bn/moving_mean"}, {"dtype": "float32", "shape": [32], "name": "block1_conv1_bn/moving_variance"}, {"dtype": "float32", "shape": [3, 3, 32, 64], "name": "block1_conv2/kernel"}, {"dtype": "float32", "shape": [64], "name": "block1_conv2_bn/gamma"}, {"dtype": "float32", "shape": [64], "name": "block1_conv2_bn/beta"}, {"dtype": "float32", "shape": [64], "name": "block1_conv2_bn/moving_mean"}, {"dtype": "float32", "shape": [64], "name": "block1_conv2_bn/moving_variance"}, {"dtype": "float32", "shape": [3, 3, 64, 1], "name": "block2_sepconv1/depthwise_kernel"}, {"dtype": "float32", "shape": [1, 1, 64, 128], "name": "block2_sepconv1/pointwise_kernel"}, {"dtype": "float32", "shape": [128], "name": "block2_sepconv1_bn/gamma"}, {"dtype": "float32", "shape": [128], "name": "block2_sepconv1_bn/beta"}, {"dtype": "float32", "shape": [128], "name": "block2_sepconv1_bn/moving_mean"}, {"dtype": "float32", "shape": [128], "name": "block2_sepconv1_bn/moving_variance"}, {"dtype": "float32", "shape": [3, 3, 128, 1], "name": "block2_sepconv2/depthwise_kernel"}, {"dtype": "float32", "shape": [1, 1, 128, 128], "name": "block2_sepconv2/pointwise_kernel"}, {"dtype": "float32", "shape": [128], "name": "block2_sepconv2_bn/gamma"}, {"dtype": "float32", "shape": [128], "name": "block2_sepconv2_bn/beta"}, {"dtype": "float32", "shape": [128], "name": "block2_sepconv2_bn/moving_mean"}, {"dtype": "float32", "shape": [128], "name": "block2_sepconv2_bn/moving_variance"}, {"dtype": "float32", "shape": [3, 3, 128, 1], "name": "block3_sepconv1/depthwise_kernel"}, {"dtype": "float32", "shape": [1, 1, 128, 256], "name": "block3_sepconv1/pointwise_kernel"}, {"dtype": "float32", "shape": [256], "name": "block3_sepconv1_bn/gamma"}, {"dtype": "float32", "shape": [256], "name": "block3_sepconv1_bn/beta"}, {"dtype": "float32", "shape": [256], "name": "block3_sepconv1_bn/moving_mean"}, {"dtype": "float32", "shape": [256], "name": "block3_sepconv1_bn/moving_variance"}, {"dtype": "float32", "shape": [3, 3, 256, 1], "name": "block3_sepconv2/depthwise_kernel"}, {"dtype": "float32", "shape": [1, 1, 256, 256], "name": "block3_sepconv2/pointwise_kernel"}, {"dtype": "float32", "shape": [256], "name": "block3_sepconv2_bn/gamma"}, {"dtype": "float32", "shape": [256], "name": "block3_sepconv2_bn/beta"}, {"dtype": "float32", "shape": [256], "name": "block3_sepconv2_bn/moving_mean"}, {"dtype": "float32", "shape": [256], "name": "block3_sepconv2_bn/moving_variance"}, {"dtype": "float32", "shape": [3, 3, 256, 1], "name": "block4_sepconv1/depthwise_kernel"}, {"dtype": "float32", "shape": [1, 1, 256, 728], "name": "block4_sepconv1/pointwise_kernel"}, {"dtype": "float32", "shape": [728], "name": "block4_sepconv1_bn/gamma"}, {"dtype": "float32", "shape": [728], "name": "block4_sepconv1_bn/beta"}, {"dtype": "float32", "shape": [728], "name": "block4_sepconv1_bn/moving_mean"}, {"dtype": "float32", "shape": [728], "name": "block4_sepconv1_bn/moving_variance"}, {"dtype": "float32", "shape": [3, 3, 728, 1], "name": "block4_sepconv2/depthwise_kernel"}, {"dtype": "float32", "shape": [1, 1, 728, 728], "name": "block4_sepconv2/pointwise_kernel"}, {"dtype": "float32", "shape": [728], "name": "block4_sepconv2_bn/gamma"}, {"dtype": "float32", "shape": [728], "name": "block4_sepconv2_bn/beta"}, {"dtype": "float32", "shape": [728], "name": "block4_sepconv2_bn/moving_mean"}, {"dtype": "float32", "shape": [728], "name": "block4_sepconv2_bn/moving_variance"}, {"dtype": "float32", "shape": [3, 3, 728, 1], "name": "block5_sepconv1/depthwise_kernel"}, {"dtype": "float32", "shape": [1, 1, 728, 728], "name": "block5_sepconv1/pointwise_kernel"}, {"dtype": "float32", "shape": [728], "name": "block5_sepconv1_bn/gamma"}, {"dtype": "float32", "shape": [728], "name": "block5_sepconv1_bn/beta"}, {"dtype": "float32", "shape": [728], "name": "block5_sepconv1_bn/moving_mean"}, {"dtype": "float32", "shape": [728], "name": "block5_sepconv1_bn/moving_variance"}, {"dtype": "float32", "shape": [3, 3, 728, 1], "name": "block5_sepconv2/depthwise_kernel"}, {"dtype": "float32", "shape": [1, 1, 728, 728], "name": "block5_sepconv2/pointwise_kernel"}, {"dtype": "float32", "shape": [728], "name": "block5_sepconv2_bn/gamma"}, {"dtype": "float32", "shape": [728], "name": "block5_sepconv2_bn/beta"}, {"dtype": "float32", "shape": [728], "name": "block5_sepconv2_bn/moving_mean"}, {"dtype": "float32", "shape": [728], "name": "block5_sepconv2_bn/moving_variance"}, {"dtype": "float32", "shape": [3, 3, 728, 1], "name": "block5_sepconv3/depthwise_kernel"}, {"dtype": "float32", "shape": [1, 1, 728, 728], "name": "block5_sepconv3/pointwise_kernel"}, {"dtype": "float32", "shape": [728], "name": "block5_sepconv3_bn/gamma"}, {"dtype": "float32", "shape": [728], "name": "block5_sepconv3_bn/beta"}, {"dtype": "float32", "shape": [728], "name": "block5_sepconv3_bn/moving_mean"}, {"dtype": "float32", "shape": [728], "name": "block5_sepconv3_bn/moving_variance"}, {"dtype": "float32", "shape": [3, 3, 728, 1], "name": "block6_sepconv1/depthwise_kernel"}, {"dtype": "float32", "shape": [1, 1, 728, 728], "name": "block6_sepconv1/pointwise_kernel"}, {"dtype": "float32", "shape": [728], "name": "block6_sepconv1_bn/gamma"}, {"dtype": "float32", "shape": [728], "name": "block6_sepconv1_bn/beta"}, {"dtype": "float32", "shape": [728], "name": "block6_sepconv1_bn/moving_mean"}, {"dtype": "float32", "shape": [728], "name": "block6_sepconv1_bn/moving_variance"}, {"dtype": "float32", "shape": [3, 3, 728, 1], "name": "block6_sepconv2/depthwise_kernel"}, {"dtype": "float32", "shape": [1, 1, 728, 728], "name": "block6_sepconv2/pointwise_kernel"}, {"dtype": "float32", "shape": [728], "name": "block6_sepconv2_bn/gamma"}, {"dtype": "float32", "shape": [728], "name": "block6_sepconv2_bn/beta"}, {"dtype": "float32", "shape": [728], "name": "block6_sepconv2_bn/moving_mean"}, {"dtype": "float32", "shape": [728], "name": "block6_sepconv2_bn/moving_variance"}, {"dtype": "float32", "shape": [3, 3, 728, 1], "name": "block6_sepconv3/depthwise_kernel"}, {"dtype": "float32", "shape": [1, 1, 728, 728], "name": "block6_sepconv3/pointwise_kernel"}, {"dtype": "float32", "shape": [728], "name": "block6_sepconv3_bn/gamma"}, {"dtype": "float32", "shape": [728], "name": "block6_sepconv3_bn/beta"}, {"dtype": "float32", "shape": [728], "name": "block6_sepconv3_bn/moving_mean"}, {"dtype": "float32", "shape": [728], "name": "block6_sepconv3_bn/moving_variance"}, {"dtype": "float32", "shape": [3, 3, 728, 1], "name": "block7_sepconv1/depthwise_kernel"}, {"dtype": "float32", "shape": [1, 1, 728, 728], "name": "block7_sepconv1/pointwise_kernel"}, {"dtype": "float32", "shape": [728], "name": "block7_sepconv1_bn/gamma"}, {"dtype": "float32", "shape": [728], "name": "block7_sepconv1_bn/beta"}, {"dtype": "float32", "shape": [728], "name": "block7_sepconv1_bn/moving_mean"}, {"dtype": "float32", "shape": [728], "name": "block7_sepconv1_bn/moving_variance"}, {"dtype": "float32", "shape": [3, 3, 728, 1], "name": "block7_sepconv2/depthwise_kernel"}, {"dtype": "float32", "shape": [1, 1, 728, 728], "name": "block7_sepconv2/pointwise_kernel"}, {"dtype": "float32", "shape": [728], "name": "block7_sepconv2_bn/gamma"}, {"dtype": "float32", "shape": [728], "name": "block7_sepconv2_bn/beta"}, {"dtype": "float32", "shape": [728], "name": "block7_sepconv2_bn/moving_mean"}, {"dtype": "float32", "shape": [728], "name": "block7_sepconv2_bn/moving_variance"}, {"dtype": "float32", "shape": [3, 3, 728, 1], "name": "block7_sepconv3/depthwise_kernel"}, {"dtype": "float32", "shape": [1, 1, 728, 728], "name": "block7_sepconv3/pointwise_kernel"}, {"dtype": "float32", "shape": [728], "name": "block7_sepconv3_bn/gamma"}, {"dtype": "float32", "shape": [728], "name": "block7_sepconv3_bn/beta"}, {"dtype": "float32", "shape": [728], "name": "block7_sepconv3_bn/moving_mean"}, {"dtype": "float32", "shape": [728], "name": "block7_sepconv3_bn/moving_variance"}, {"dtype": "float32", "shape": [3, 3, 728, 1], "name": "block8_sepconv1/depthwise_kernel"}, {"dtype": "float32", "shape": [1, 1, 728, 728], "name": "block8_sepconv1/pointwise_kernel"}, {"dtype": "float32", "shape": [728], "name": "block8_sepconv1_bn/gamma"}, {"dtype": "float32", "shape": [728], "name": "block8_sepconv1_bn/beta"}, {"dtype": "float32", "shape": [728], "name": "block8_sepconv1_bn/moving_mean"}, {"dtype": "float32", "shape": [728], "name": "block8_sepconv1_bn/moving_variance"}, {"dtype": "float32", "shape": [3, 3, 728, 1], "name": "block8_sepconv2/depthwise_kernel"}, {"dtype": "float32", "shape": [1, 1, 728, 728], "name": "block8_sepconv2/pointwise_kernel"}, {"dtype": "float32", "shape": [728], "name": "block8_sepconv2_bn/gamma"}, {"dtype": "float32", "shape": [728], "name": "block8_sepconv2_bn/beta"}, {"dtype": "float32", "shape": [728], "name": "block8_sepconv2_bn/moving_mean"}, {"dtype": "float32", "shape": [728], "name": "block8_sepconv2_bn/moving_variance"}, {"dtype": "float32", "shape": [3, 3, 728, 1], "name": "block8_sepconv3/depthwise_kernel"}, {"dtype": "float32", "shape": [1, 1, 728, 728], "name": "block8_sepconv3/pointwise_kernel"}, {"dtype": "float32", "shape": [728], "name": "block8_sepconv3_bn/gamma"}, {"dtype": "float32", "shape": [728], "name": "block8_sepconv3_bn/beta"}, {"dtype": "float32", "shape": [728], "name": "block8_sepconv3_bn/moving_mean"}, {"dtype": "float32", "shape": [728], "name": "block8_sepconv3_bn/moving_variance"}, {"dtype": "float32", "shape": [3, 3, 728, 1], "name": "block9_sepconv1/depthwise_kernel"}, {"dtype": "float32", "shape": [1, 1, 728, 728], "name": "block9_sepconv1/pointwise_kernel"}, {"dtype": "float32", "shape": [728], "name": "block9_sepconv1_bn/gamma"}, {"dtype": "float32", "shape": [728], "name": "block9_sepconv1_bn/beta"}, {"dtype": "float32", "shape": [728], "name": "block9_sepconv1_bn/moving_mean"}, {"dtype": "float32", "shape": [728], "name": "block9_sepconv1_bn/moving_variance"}, {"dtype": "float32", "shape": [3, 3, 728, 1], "name": "block9_sepconv2/depthwise_kernel"}, {"dtype": "float32", "shape": [1, 1, 728, 728], "name": "block9_sepconv2/pointwise_kernel"}, {"dtype": "float32", "shape": [728], "name": "block9_sepconv2_bn/gamma"}, {"dtype": "float32", "shape": [728], "name": "block9_sepconv2_bn/beta"}, {"dtype": "float32", "shape": [728], "name": "block9_sepconv2_bn/moving_mean"}, {"dtype": "float32", "shape": [728], "name": "block9_sepconv2_bn/moving_variance"}, {"dtype": "float32", "shape": [3, 3, 728, 1], "name": "block9_sepconv3/depthwise_kernel"}, {"dtype": "float32", "shape": [1, 1, 728, 728], "name": "block9_sepconv3/pointwise_kernel"}, {"dtype": "float32", "shape": [728], "name": "block9_sepconv3_bn/gamma"}, {"dtype": "float32", "shape": [728], "name": "block9_sepconv3_bn/beta"}, {"dtype": "float32", "shape": [728], "name": "block9_sepconv3_bn/moving_mean"}, {"dtype": "float32", "shape": [728], "name": "block9_sepconv3_bn/moving_variance"}, {"dtype": "float32", "shape": [1, 1, 64, 128], "name": "conv2d_35/kernel"}, {"dtype": "float32", "shape": [1, 1, 128, 256], "name": "conv2d_36/kernel"}, {"dtype": "float32", "shape": [1, 1, 256, 728], "name": "conv2d_37/kernel"}, {"dtype": "float32", "shape": [1, 1, 728, 1024], "name": "conv2d_38/kernel"}, {"dtype": "float32", "shape": [2048, 1024], "name": "dense_32/kernel"}, {"dtype": "float32", "shape": [1024], "name": "dense_32/bias"}, {"dtype": "float32", "shape": [1024, 1024], "name": "dense_33/kernel"}, {"dtype": "float32", "shape": [1024], "name": "dense_33/bias"}, {"dtype": "float32", "shape": [1024, 512], "name": "dense_34/kernel"}, {"dtype": "float32", "shape": [512], "name": "dense_34/bias"}, {"dtype": "float32", "shape": [512, 29], "name": "dense_35/kernel"}, {"dtype": "float32", "shape": [29], "name": "dense_35/bias"}]}], "modelTopology": {"training_config": {"loss": "categorical_crossentropy", "loss_weights": null, "metrics": ["accuracy"], "optimizer_config": {"class_name": "Adam", "config": {"beta_1": 0.8999999761581421, "beta_2": 0.9990000128746033, "name": "Adam", "decay": 0.0, "epsilon": 1e-07, "learning_rate": 0.0010000000474974513, "amsgrad": false}}, "weighted_metrics": null, "sample_weight_mode": null}, "keras_version": "2.2.4-tf", "model_config": {"class_name": "Model", "config": {"layers": [{"class_name": "InputLayer", "inbound_nodes": [], "config": {"ragged": false, "dtype": "float32", "batch_input_shape": [null, 224, 224, 3], "name": "input_10", "sparse": false}, "name": "input_10"}, {"class_name": "Conv2D", "inbound_nodes": [[["input_10", 0, 0, {}]]], "config": {"kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "name": "block1_conv1", "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "dtype": "float32", "activation": "linear", "trainable": false, "data_format": "channels_last", "padding": "valid", "strides": [2, 2], "dilation_rate": [1, 1], "kernel_regularizer": null, "filters": 32, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": false, "activity_regularizer": null, "kernel_size": [3, 3]}, "name": "block1_conv1"}, {"class_name": "BatchNormalization", "inbound_nodes": [[["block1_conv1", 0, 0, {}]]], "config": {"beta_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "name": "block1_conv1_bn", "dtype": "float32", "trainable": false, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "scale": true, "axis": [3], "epsilon": 0.001, "gamma_constraint": null, "gamma_regularizer": null, "beta_regularizer": null, "momentum": 0.99, "center": true}, "name": "block1_conv1_bn"}, {"class_name": "Activation", "inbound_nodes": [[["block1_conv1_bn", 0, 0, {}]]], "config": {"dtype": "float32", "activation": "relu", "trainable": false, "name": "block1_conv1_act"}, "name": "block1_conv1_act"}, {"class_name": "Conv2D", "inbound_nodes": [[["block1_conv1_act", 0, 0, {}]]], "config": {"kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "name": "block1_conv2", "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "dtype": "float32", "activation": "linear", "trainable": false, "data_format": "channels_last", "padding": "valid", "strides": [1, 1], "dilation_rate": [1, 1], "kernel_regularizer": null, "filters": 64, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": false, "activity_regularizer": null, "kernel_size": [3, 3]}, "name": "block1_conv2"}, {"class_name": "BatchNormalization", "inbound_nodes": [[["block1_conv2", 0, 0, {}]]], "config": {"beta_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "name": "block1_conv2_bn", "dtype": "float32", "trainable": false, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "scale": true, "axis": [3], "epsilon": 0.001, "gamma_constraint": null, "gamma_regularizer": null, "beta_regularizer": null, "momentum": 0.99, "center": true}, "name": "block1_conv2_bn"}, {"class_name": "Activation", "inbound_nodes": [[["block1_conv2_bn", 0, 0, {}]]], "config": {"dtype": "float32", "activation": "relu", "trainable": false, "name": "block1_conv2_act"}, "name": "block1_conv2_act"}, {"class_name": "SeparableConv2D", "inbound_nodes": [[["block1_conv2_act", 0, 0, {}]]], "config": {"pointwise_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "dtype": "float32", "trainable": false, "pointwise_regularizer": null, "filters": 128, "depthwise_regularizer": null, "use_bias": false, "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "linear", "depthwise_constraint": null, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "kernel_constraint": null, "activity_regularizer": null, "depthwise_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "padding": "same", "strides": [1, 1], "name": "block2_sepconv1", "bias_constraint": null, "depth_multiplier": 1, "pointwise_constraint": null, "data_format": "channels_last", "dilation_rate": [1, 1], "kernel_regularizer": null, "kernel_size": [3, 3]}, "name": "block2_sepconv1"}, {"class_name": "BatchNormalization", "inbound_nodes": [[["block2_sepconv1", 0, 0, {}]]], "config": {"beta_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "name": "block2_sepconv1_bn", "dtype": "float32", "trainable": false, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "scale": true, "axis": [3], "epsilon": 0.001, "gamma_constraint": null, "gamma_regularizer": null, "beta_regularizer": null, "momentum": 0.99, "center": true}, "name": "block2_sepconv1_bn"}, {"class_name": "Activation", "inbound_nodes": [[["block2_sepconv1_bn", 0, 0, {}]]], "config": {"dtype": "float32", "activation": "relu", "trainable": false, "name": "block2_sepconv2_act"}, "name": "block2_sepconv2_act"}, {"class_name": "SeparableConv2D", "inbound_nodes": [[["block2_sepconv2_act", 0, 0, {}]]], "config": {"pointwise_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "dtype": "float32", "trainable": false, "pointwise_regularizer": null, "filters": 128, "depthwise_regularizer": null, "use_bias": false, "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "linear", "depthwise_constraint": null, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "kernel_constraint": null, "activity_regularizer": null, "depthwise_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "padding": "same", "strides": [1, 1], "name": "block2_sepconv2", "bias_constraint": null, "depth_multiplier": 1, "pointwise_constraint": null, "data_format": "channels_last", "dilation_rate": [1, 1], "kernel_regularizer": null, "kernel_size": [3, 3]}, "name": "block2_sepconv2"}, {"class_name": "BatchNormalization", "inbound_nodes": [[["block2_sepconv2", 0, 0, {}]]], "config": {"beta_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "name": "block2_sepconv2_bn", "dtype": "float32", "trainable": false, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "scale": true, "axis": [3], "epsilon": 0.001, "gamma_constraint": null, "gamma_regularizer": null, "beta_regularizer": null, "momentum": 0.99, "center": true}, "name": "block2_sepconv2_bn"}, {"class_name": "Conv2D", "inbound_nodes": [[["block1_conv2_act", 0, 0, {}]]], "config": {"kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "name": "conv2d_35", "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "dtype": "float32", "activation": "linear", "trainable": false, "data_format": "channels_last", "padding": "same", "strides": [2, 2], "dilation_rate": [1, 1], "kernel_regularizer": null, "filters": 128, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": false, "activity_regularizer": null, "kernel_size": [1, 1]}, "name": "conv2d_35"}, {"class_name": "MaxPooling2D", "inbound_nodes": [[["block2_sepconv2_bn", 0, 0, {}]]], "config": {"name": "block2_pool", "dtype": "float32", "trainable": false, "data_format": "channels_last", "pool_size": [3, 3], "padding": "same", "strides": [2, 2]}, "name": "block2_pool"}, {"class_name": "BatchNormalization", "inbound_nodes": [[["conv2d_35", 0, 0, {}]]], "config": {"beta_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "name": "batch_normalization_35", "dtype": "float32", "trainable": false, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "scale": true, "axis": [3], "epsilon": 0.001, "gamma_constraint": null, "gamma_regularizer": null, "beta_regularizer": null, "momentum": 0.99, "center": true}, "name": "batch_normalization_35"}, {"class_name": "Add", "inbound_nodes": [[["block2_pool", 0, 0, {}], ["batch_normalization_35", 0, 0, {}]]], "config": {"dtype": "float32", "trainable": false, "name": "add_103"}, "name": "add_103"}, {"class_name": "Activation", "inbound_nodes": [[["add_103", 0, 0, {}]]], "config": {"dtype": "float32", "activation": "relu", "trainable": false, "name": "block3_sepconv1_act"}, "name": "block3_sepconv1_act"}, {"class_name": "SeparableConv2D", "inbound_nodes": [[["block3_sepconv1_act", 0, 0, {}]]], "config": {"pointwise_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "dtype": "float32", "trainable": false, "pointwise_regularizer": null, "filters": 256, "depthwise_regularizer": null, "use_bias": false, "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "linear", "depthwise_constraint": null, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "kernel_constraint": null, "activity_regularizer": null, "depthwise_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "padding": "same", "strides": [1, 1], "name": "block3_sepconv1", "bias_constraint": null, "depth_multiplier": 1, "pointwise_constraint": null, "data_format": "channels_last", "dilation_rate": [1, 1], "kernel_regularizer": null, "kernel_size": [3, 3]}, "name": "block3_sepconv1"}, {"class_name": "BatchNormalization", "inbound_nodes": [[["block3_sepconv1", 0, 0, {}]]], "config": {"beta_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "name": "block3_sepconv1_bn", "dtype": "float32", "trainable": false, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "scale": true, "axis": [3], "epsilon": 0.001, "gamma_constraint": null, "gamma_regularizer": null, "beta_regularizer": null, "momentum": 0.99, "center": true}, "name": "block3_sepconv1_bn"}, {"class_name": "Activation", "inbound_nodes": [[["block3_sepconv1_bn", 0, 0, {}]]], "config": {"dtype": "float32", "activation": "relu", "trainable": false, "name": "block3_sepconv2_act"}, "name": "block3_sepconv2_act"}, {"class_name": "SeparableConv2D", "inbound_nodes": [[["block3_sepconv2_act", 0, 0, {}]]], "config": {"pointwise_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "dtype": "float32", "trainable": true, "pointwise_regularizer": null, "filters": 256, "depthwise_regularizer": null, "use_bias": false, "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "linear", "depthwise_constraint": null, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "kernel_constraint": null, "activity_regularizer": null, "depthwise_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "padding": "same", "strides": [1, 1], "name": "block3_sepconv2", "bias_constraint": null, "depth_multiplier": 1, "pointwise_constraint": null, "data_format": "channels_last", "dilation_rate": [1, 1], "kernel_regularizer": null, "kernel_size": [3, 3]}, "name": "block3_sepconv2"}, {"class_name": "BatchNormalization", "inbound_nodes": [[["block3_sepconv2", 0, 0, {}]]], "config": {"beta_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "name": "block3_sepconv2_bn", "dtype": "float32", "trainable": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "scale": true, "axis": [3], "epsilon": 0.001, "gamma_constraint": null, "gamma_regularizer": null, "beta_regularizer": null, "momentum": 0.99, "center": true}, "name": "block3_sepconv2_bn"}, {"class_name": "Conv2D", "inbound_nodes": [[["add_103", 0, 0, {}]]], "config": {"kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "name": "conv2d_36", "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "dtype": "float32", "activation": "linear", "trainable": true, "data_format": "channels_last", "padding": "same", "strides": [2, 2], "dilation_rate": [1, 1], "kernel_regularizer": null, "filters": 256, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": false, "activity_regularizer": null, "kernel_size": [1, 1]}, "name": "conv2d_36"}, {"class_name": "MaxPooling2D", "inbound_nodes": [[["block3_sepconv2_bn", 0, 0, {}]]], "config": {"name": "block3_pool", "dtype": "float32", "trainable": true, "data_format": "channels_last", "pool_size": [3, 3], "padding": "same", "strides": [2, 2]}, "name": "block3_pool"}, {"class_name": "BatchNormalization", "inbound_nodes": [[["conv2d_36", 0, 0, {}]]], "config": {"beta_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "name": "batch_normalization_36", "dtype": "float32", "trainable": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "scale": true, "axis": [3], "epsilon": 0.001, "gamma_constraint": null, "gamma_regularizer": null, "beta_regularizer": null, "momentum": 0.99, "center": true}, "name": "batch_normalization_36"}, {"class_name": "Add", "inbound_nodes": [[["block3_pool", 0, 0, {}], ["batch_normalization_36", 0, 0, {}]]], "config": {"dtype": "float32", "trainable": true, "name": "add_104"}, "name": "add_104"}, {"class_name": "Activation", "inbound_nodes": [[["add_104", 0, 0, {}]]], "config": {"dtype": "float32", "activation": "relu", "trainable": true, "name": "block4_sepconv1_act"}, "name": "block4_sepconv1_act"}, {"class_name": "SeparableConv2D", "inbound_nodes": [[["block4_sepconv1_act", 0, 0, {}]]], "config": {"pointwise_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "dtype": "float32", "trainable": true, "pointwise_regularizer": null, "filters": 728, "depthwise_regularizer": null, "use_bias": false, "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "linear", "depthwise_constraint": null, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "kernel_constraint": null, "activity_regularizer": null, "depthwise_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "padding": "same", "strides": [1, 1], "name": "block4_sepconv1", "bias_constraint": null, "depth_multiplier": 1, "pointwise_constraint": null, "data_format": "channels_last", "dilation_rate": [1, 1], "kernel_regularizer": null, "kernel_size": [3, 3]}, "name": "block4_sepconv1"}, {"class_name": "BatchNormalization", "inbound_nodes": [[["block4_sepconv1", 0, 0, {}]]], "config": {"beta_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "name": "block4_sepconv1_bn", "dtype": "float32", "trainable": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "scale": true, "axis": [3], "epsilon": 0.001, "gamma_constraint": null, "gamma_regularizer": null, "beta_regularizer": null, "momentum": 0.99, "center": true}, "name": "block4_sepconv1_bn"}, {"class_name": "Activation", "inbound_nodes": [[["block4_sepconv1_bn", 0, 0, {}]]], "config": {"dtype": "float32", "activation": "relu", "trainable": true, "name": "block4_sepconv2_act"}, "name": "block4_sepconv2_act"}, {"class_name": "SeparableConv2D", "inbound_nodes": [[["block4_sepconv2_act", 0, 0, {}]]], "config": {"pointwise_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "dtype": "float32", "trainable": true, "pointwise_regularizer": null, "filters": 728, "depthwise_regularizer": null, "use_bias": false, "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "linear", "depthwise_constraint": null, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "kernel_constraint": null, "activity_regularizer": null, "depthwise_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "padding": "same", "strides": [1, 1], "name": "block4_sepconv2", "bias_constraint": null, "depth_multiplier": 1, "pointwise_constraint": null, "data_format": "channels_last", "dilation_rate": [1, 1], "kernel_regularizer": null, "kernel_size": [3, 3]}, "name": "block4_sepconv2"}, {"class_name": "BatchNormalization", "inbound_nodes": [[["block4_sepconv2", 0, 0, {}]]], "config": {"beta_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "name": "block4_sepconv2_bn", "dtype": "float32", "trainable": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "scale": true, "axis": [3], "epsilon": 0.001, "gamma_constraint": null, "gamma_regularizer": null, "beta_regularizer": null, "momentum": 0.99, "center": true}, "name": "block4_sepconv2_bn"}, {"class_name": "Conv2D", "inbound_nodes": [[["add_104", 0, 0, {}]]], "config": {"kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "name": "conv2d_37", "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "dtype": "float32", "activation": "linear", "trainable": true, "data_format": "channels_last", "padding": "same", "strides": [2, 2], "dilation_rate": [1, 1], "kernel_regularizer": null, "filters": 728, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": false, "activity_regularizer": null, "kernel_size": [1, 1]}, "name": "conv2d_37"}, {"class_name": "MaxPooling2D", "inbound_nodes": [[["block4_sepconv2_bn", 0, 0, {}]]], "config": {"name": "block4_pool", "dtype": "float32", "trainable": true, "data_format": "channels_last", "pool_size": [3, 3], "padding": "same", "strides": [2, 2]}, "name": "block4_pool"}, {"class_name": "BatchNormalization", "inbound_nodes": [[["conv2d_37", 0, 0, {}]]], "config": {"beta_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "name": "batch_normalization_37", "dtype": "float32", "trainable": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "scale": true, "axis": [3], "epsilon": 0.001, "gamma_constraint": null, "gamma_regularizer": null, "beta_regularizer": null, "momentum": 0.99, "center": true}, "name": "batch_normalization_37"}, {"class_name": "Add", "inbound_nodes": [[["block4_pool", 0, 0, {}], ["batch_normalization_37", 0, 0, {}]]], "config": {"dtype": "float32", "trainable": true, "name": "add_105"}, "name": "add_105"}, {"class_name": "Activation", "inbound_nodes": [[["add_105", 0, 0, {}]]], "config": {"dtype": "float32", "activation": "relu", "trainable": true, "name": "block5_sepconv1_act"}, "name": "block5_sepconv1_act"}, {"class_name": "SeparableConv2D", "inbound_nodes": [[["block5_sepconv1_act", 0, 0, {}]]], "config": {"pointwise_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "dtype": "float32", "trainable": true, "pointwise_regularizer": null, "filters": 728, "depthwise_regularizer": null, "use_bias": false, "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "linear", "depthwise_constraint": null, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "kernel_constraint": null, "activity_regularizer": null, "depthwise_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "padding": "same", "strides": [1, 1], "name": "block5_sepconv1", "bias_constraint": null, "depth_multiplier": 1, "pointwise_constraint": null, "data_format": "channels_last", "dilation_rate": [1, 1], "kernel_regularizer": null, "kernel_size": [3, 3]}, "name": "block5_sepconv1"}, {"class_name": "BatchNormalization", "inbound_nodes": [[["block5_sepconv1", 0, 0, {}]]], "config": {"beta_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "name": "block5_sepconv1_bn", "dtype": "float32", "trainable": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "scale": true, "axis": [3], "epsilon": 0.001, "gamma_constraint": null, "gamma_regularizer": null, "beta_regularizer": null, "momentum": 0.99, "center": true}, "name": "block5_sepconv1_bn"}, {"class_name": "Activation", "inbound_nodes": [[["block5_sepconv1_bn", 0, 0, {}]]], "config": {"dtype": "float32", "activation": "relu", "trainable": true, "name": "block5_sepconv2_act"}, "name": "block5_sepconv2_act"}, {"class_name": "SeparableConv2D", "inbound_nodes": [[["block5_sepconv2_act", 0, 0, {}]]], "config": {"pointwise_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "dtype": "float32", "trainable": true, "pointwise_regularizer": null, "filters": 728, "depthwise_regularizer": null, "use_bias": false, "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "linear", "depthwise_constraint": null, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "kernel_constraint": null, "activity_regularizer": null, "depthwise_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "padding": "same", "strides": [1, 1], "name": "block5_sepconv2", "bias_constraint": null, "depth_multiplier": 1, "pointwise_constraint": null, "data_format": "channels_last", "dilation_rate": [1, 1], "kernel_regularizer": null, "kernel_size": [3, 3]}, "name": "block5_sepconv2"}, {"class_name": "BatchNormalization", "inbound_nodes": [[["block5_sepconv2", 0, 0, {}]]], "config": {"beta_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "name": "block5_sepconv2_bn", "dtype": "float32", "trainable": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "scale": true, "axis": [3], "epsilon": 0.001, "gamma_constraint": null, "gamma_regularizer": null, "beta_regularizer": null, "momentum": 0.99, "center": true}, "name": "block5_sepconv2_bn"}, {"class_name": "Activation", "inbound_nodes": [[["block5_sepconv2_bn", 0, 0, {}]]], "config": {"dtype": "float32", "activation": "relu", "trainable": true, "name": "block5_sepconv3_act"}, "name": "block5_sepconv3_act"}, {"class_name": "SeparableConv2D", "inbound_nodes": [[["block5_sepconv3_act", 0, 0, {}]]], "config": {"pointwise_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "dtype": "float32", "trainable": true, "pointwise_regularizer": null, "filters": 728, "depthwise_regularizer": null, "use_bias": false, "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "linear", "depthwise_constraint": null, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "kernel_constraint": null, "activity_regularizer": null, "depthwise_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "padding": "same", "strides": [1, 1], "name": "block5_sepconv3", "bias_constraint": null, "depth_multiplier": 1, "pointwise_constraint": null, "data_format": "channels_last", "dilation_rate": [1, 1], "kernel_regularizer": null, "kernel_size": [3, 3]}, "name": "block5_sepconv3"}, {"class_name": "BatchNormalization", "inbound_nodes": [[["block5_sepconv3", 0, 0, {}]]], "config": {"beta_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "name": "block5_sepconv3_bn", "dtype": "float32", "trainable": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "scale": true, "axis": [3], "epsilon": 0.001, "gamma_constraint": null, "gamma_regularizer": null, "beta_regularizer": null, "momentum": 0.99, "center": true}, "name": "block5_sepconv3_bn"}, {"class_name": "Add", "inbound_nodes": [[["block5_sepconv3_bn", 0, 0, {}], ["add_105", 0, 0, {}]]], "config": {"dtype": "float32", "trainable": true, "name": "add_106"}, "name": "add_106"}, {"class_name": "Activation", "inbound_nodes": [[["add_106", 0, 0, {}]]], "config": {"dtype": "float32", "activation": "relu", "trainable": true, "name": "block6_sepconv1_act"}, "name": "block6_sepconv1_act"}, {"class_name": "SeparableConv2D", "inbound_nodes": [[["block6_sepconv1_act", 0, 0, {}]]], "config": {"pointwise_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "dtype": "float32", "trainable": true, "pointwise_regularizer": null, "filters": 728, "depthwise_regularizer": null, "use_bias": false, "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "linear", "depthwise_constraint": null, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "kernel_constraint": null, "activity_regularizer": null, "depthwise_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "padding": "same", "strides": [1, 1], "name": "block6_sepconv1", "bias_constraint": null, "depth_multiplier": 1, "pointwise_constraint": null, "data_format": "channels_last", "dilation_rate": [1, 1], "kernel_regularizer": null, "kernel_size": [3, 3]}, "name": "block6_sepconv1"}, {"class_name": "BatchNormalization", "inbound_nodes": [[["block6_sepconv1", 0, 0, {}]]], "config": {"beta_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "name": "block6_sepconv1_bn", "dtype": "float32", "trainable": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "scale": true, "axis": [3], "epsilon": 0.001, "gamma_constraint": null, "gamma_regularizer": null, "beta_regularizer": null, "momentum": 0.99, "center": true}, "name": "block6_sepconv1_bn"}, {"class_name": "Activation", "inbound_nodes": [[["block6_sepconv1_bn", 0, 0, {}]]], "config": {"dtype": "float32", "activation": "relu", "trainable": true, "name": "block6_sepconv2_act"}, "name": "block6_sepconv2_act"}, {"class_name": "SeparableConv2D", "inbound_nodes": [[["block6_sepconv2_act", 0, 0, {}]]], "config": {"pointwise_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "dtype": "float32", "trainable": true, "pointwise_regularizer": null, "filters": 728, "depthwise_regularizer": null, "use_bias": false, "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "linear", "depthwise_constraint": null, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "kernel_constraint": null, "activity_regularizer": null, "depthwise_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "padding": "same", "strides": [1, 1], "name": "block6_sepconv2", "bias_constraint": null, "depth_multiplier": 1, "pointwise_constraint": null, "data_format": "channels_last", "dilation_rate": [1, 1], "kernel_regularizer": null, "kernel_size": [3, 3]}, "name": "block6_sepconv2"}, {"class_name": "BatchNormalization", "inbound_nodes": [[["block6_sepconv2", 0, 0, {}]]], "config": {"beta_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "name": "block6_sepconv2_bn", "dtype": "float32", "trainable": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "scale": true, "axis": [3], "epsilon": 0.001, "gamma_constraint": null, "gamma_regularizer": null, "beta_regularizer": null, "momentum": 0.99, "center": true}, "name": "block6_sepconv2_bn"}, {"class_name": "Activation", "inbound_nodes": [[["block6_sepconv2_bn", 0, 0, {}]]], "config": {"dtype": "float32", "activation": "relu", "trainable": true, "name": "block6_sepconv3_act"}, "name": "block6_sepconv3_act"}, {"class_name": "SeparableConv2D", "inbound_nodes": [[["block6_sepconv3_act", 0, 0, {}]]], "config": {"pointwise_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "dtype": "float32", "trainable": true, "pointwise_regularizer": null, "filters": 728, "depthwise_regularizer": null, "use_bias": false, "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "linear", "depthwise_constraint": null, "kernel_initializer": {"class_name": 